START_MENU_TEXT = """
Добро пожаловать в *@gameexez_bot*
Начав использование бота Вы подтверждаете свое согласие с Пользовательским соглашением
"""

REFERENCE_MENU_TEXT = """
🎯 *Реферальная программа* 🎯

✨ *Зарабатывай монеты вместе с друзьями!* ✨

📌 *Как это работает:*
• Создай свою уникальную ссылку
• Приглашай друзей в бота
• Получай щедрые бонусы за каждого друга!

💰 *Выгода для тебя:*
└── 🎁 +500,000 монет за каждого приглашенного друга!

🚀 *Твои преимущества:*
• Быстрый старт с большим балансом
• Увеличение капитала без усилий
• Помощь друзьям начать с бонусом

🎊 *Начни приглашать прямо сейчас и увеличивай свой капитал!*

💫 *Чем больше друзей - тем больше монет!*
"""

REFERENCE_LINK_TEXT = """
Вот ваша реферальная ссылка:
{link}

"""


PROFILE_MENU_TEXT = """
*{user}:*♠️♥️

💰 Монеты: *{coins}*
✅ Выиграно: *{win_coins}*
❌ Проиграно: *{defeat_coins}*
🏆 Макс. выигрыш: *{max_win_coins}*
⚡ Макс. ставка: *{min_win_coins}*
"""

MAIN_MENU_TEXT = """
🎯 *Главное меню*

Выберите нужный раздел:
"""

LINKS_TEXT = """
📜‼️Все свежие новости и обновления нашего бота вы сможете найти в этом канале - [https://t.me/EXEZ_NOVOOSTI](https://t.me/EXEZ_NOVOOSTI)

1. 🥂💸 ВИП рулетка - [https://t.me/EXEZ_VIP](https://t.me/EXEZ_VIP)
для богатых для випов, которые сможет поучаствовать себя влиятными игроками.

2. 💣🙃 Без правила рулетка - [https://t.me/EXEZ_BEZ](https://t.me/EXEZ_BEZ)
вы сможете играть тут сколько хотите. Чат для игрокам без правила.

3. 🏆🏆 Турнир чат - [https://t.me/EXEZ_TUR](https://t.me/EXEZ_TUR)
чат для проведений турниров для игрокам.

4. ⚜ Зона рулетка - [https://t.me/EXEZ_ZONE](https://t.me/EXEZ_ZONE)
чат для спокойных игроков со стандартными, сторогими правил.

5. 🇰🇿 Қазақстан рулетка - [https://t.me/EXEZ_KZ](https://t.me/EXEZ_KZ)
чат для игроков Қазақстана

6. 🇰🇬 Кыргызстан рулетка - [https://t.me/EXEZ_KG](https://t.me/EXEZ_KG)
чат для самых популярных игроков Кыргызстана.
"""
